IdeaRS.OpenModel.Concrete.SecondOrderEffectMethodEc2
The type of method for calculation second order effect.

IdeaRS.OpenModel.Concrete.SecondOrderEffectMethodEc2.NominalStiffness
The following model may be used to estimate the nominal stiffness of slender compression
members with arbitrary cross section.

IdeaRS.OpenModel.Concrete.SecondOrderEffectMethodEc2.NominalCurvature
The method based on nominal curvature.
This method is primarily suitable for isolated members with constant
normal force and a defined effective length.